backend/app/controllers/photos_controller.rb

  def create
    @photo = Photo.new(photo_params)

    if @photo.save
---
INSERT INTO "photos" ("img_src", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)